app/controllers/deals_controller.rb

SELECT "cities".* FROM "cities" WHERE (cities.name <> 'Oferta Nacional') ORDER BY cities.state, cities.name
---
  def index
    if params[:search]
      @message = "Não foi encontrada nenhuma oferta com '#{params[:search]}'" if @deals.empty? && !(params[:search].blank?) && params[:search_city].blank?

SELECT "deals".* FROM "deals" WHERE (deals.end_date >= '2012-04-21' OR deals.end_date is null) AND ((deals.up_votes + deals.down_votes) > 0) ORDER BY (deals.up_votes / (deals.up_votes + deals.down_votes)) DESC LIMIT 3
---
  def find_deals
    @deals = Deal.paginate(:page => params[:page], :per_page => 12)