app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
---
  def find_user_with_deals
    if User.find_by_username(params[:id])
      @deals = Deal.by_username_and_following(params[:id]).paginate(:page => params[:page]).order('created_at DESC')

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT "deals".* FROM "deals" WHERE "deals"."user_id" = 18
---
  def find_users
    @users = User.paginate(:page => params[:page])
    @users = @users.search(params[:search].gsub(" ", "%")) if params[:search]
    @users_with_more_deals = User.order_by_deals.limit(5)